matthew73210/birdnetgo-m5stack-atom-echo-rtsp-mic/src/esp32_rtsp_mic_birdnetgo.cpp
#include <WiFi.h>
#include <WiFiManager.h>
#include <WiFiUdp.h>
#include <ArduinoOTA.h>
#include <ESPmDNS.h>
#include "driver/i2s.h"
#include <Preferences.h>
#include <time.h>
#include <math.h>
#include <FastLED.h>
#include "WebUI.h"

// ================== DUAL-CORE AUDIO ARCHITECTURE ==================
// Core 1: Complete audio pipeline (I2S → process → RTP → WiFi)
// Core 0: Web UI, diagnostics, RTSP protocol, client management
// PDM microphone outputs 16-bit samples directly

// Pointer handoff: Core 0 sets on PLAY, Core 1 uses for streaming, clears on failure
WiFiClient* volatile streamClient = NULL;

enum RtspTransportMode : uint8_t {
    RTSP_TRANSPORT_TCP_INTERLEAVED = 0,
    RTSP_TRANSPORT_UDP_UNICAST = 1,
};
TaskHandle_t audioCaptureTaskHandle = NULL;
volatile bool audioTaskRunning = false;

// Cross-core synchronization primitives
portMUX_TYPE logMux = portMUX_INITIALIZER_UNLOCKED;  // spinlock for log ring buffer
volatile bool stopStreamRequested = false;   // Core 0 asks Core 1 to stop
volatile bool streamCleanupDone = false;     // Core 1 confirms cleanup complete
SemaphoreHandle_t taskExitSemaphore = NULL;  // confirmed task exit
volatile bool core1OwnsLED = false;          // LED ownership flag

// ================== SETTINGS (ESP32 RTSP Mic for BirdNET-Go) ==================
#define FW_VERSION "2.6.0"
// Expose FW version as a global C string for WebUI/API

const char* FW_VERSION_STR = FW_VERSION;
static const uint16_t OTA_PORT = 3232;
static const char* NTP_TZ = "UTC0";

// Forward declarations required now that the main sketch is compiled as C++.
const char* rtspTransportModeName(RtspTransportMode mode);
String currentRtspTransportName();
String extractRtspHeader(const String& request, const char* headerName);
bool parseRtspClientPorts(const String& transportHeader, uint16_t& rtpPort, uint16_t& rtcpPort);
float wifiPowerLevelToDbm(wifi_power_t level);
wifi_power_t pickWifiPowerLevel(float requestedDbm);
void applyWifiTxPower(float requestedDbm);
String describeHardwareProfile();
String describeFilterChain();
void fillConcealmentBlock(int16_t* buffer, size_t samples);
void recordTelemetrySample();
void updateHighpassCoeffs(uint32_t sampleRate, uint16_t cutoffHz);
String formatUptime(unsigned long ms);
String formatSince(unsigned long timestampMs);
bool isTemperatureValid(float tempC);
void persistOverheatNote(const String& reason);
void recordOverheatTrip(float tempC, const String& reason);
void checkTemperature();
void checkPerformance();
void checkWiFiHealth();
void checkScheduledReset();
void loadAudioSettings();
void saveAudioSettings();
void scheduleReboot(unsigned long delayMs = 0);
size_t effectiveAudioChunkSize();
int computeI2sDmaBufferLen(uint16_t chunkSamples);
int computeI2sDmaBufferCount(uint16_t chunkSamples);
size_t computeI2sReadBufferSamples(uint16_t chunkSamples);
uint32_t computeRecommendedMinRate();
void resetToDefaultSettings();
void restartI2S();
bool timeIsSynced();
String logTimestamp();
void simplePrint(const String& msg);
void simplePrintln(const String& msg);
void resumeRtspServerAfterOtaFailure();
void setupArduinoOta();
void drainRtspReceiveBuffer(WiFiClient& client);
void updateFftFromBlock(const int16_t* samples, size_t count);
void audioCaptureTask(void* parameter);
bool startAudioCaptureTask();
void stopAudioCaptureTask();
bool requestStreamStop(const char* reason = nullptr);
void setup_i2s_driver();
bool writeAll(WiFiClient& client, const uint8_t* data, size_t len);
void sendRTPPacket(WiFiClient& client, int16_t* audioData, size_t samples);
void handleRTSPCommand(WiFiClient& client, String& request);
void processRTSP();
void setup();
void loop();

// -- DEFAULT PARAMETERS (configurable via Web UI / API)
#define DEFAULT_SAMPLE_RATE 16000  // Unit Mini PDM / BirdNET-Go preferred rate
#define DEFAULT_GAIN_FACTOR 1.0f
#define DEFAULT_BUFFER_SIZE 1024   // 64ms @ 16kHz - lower default latency while keeping WiFi headroom
#define DEFAULT_WIFI_TX_DBM 19.5f  // Default WiFi TX power in dBm
#define DEFAULT_NETWORK_HOSTNAME "atoms3mic"
// High-pass filter defaults (to remove low-frequency rumble)
#define DEFAULT_HPF_ENABLED true
#define DEFAULT_HPF_CUTOFF_HZ 450

// Thermal protection defaults
#define DEFAULT_OVERHEAT_PROTECTION true
#define DEFAULT_OVERHEAT_LIMIT_C 80
#define OVERHEAT_MIN_LIMIT_C 30
#define OVERHEAT_MAX_LIMIT_C 95
#define OVERHEAT_LIMIT_STEP_C 5

// -- Pins (AtomS3 Lite + Unit Mini PDM)
// M5's reference wiring for the PDM Unit is CLK=G1 and DATA=G2.
#define I2S_CLK_PIN      1  // PDM CLK (G1)
#define I2S_DATA_IN_PIN  2  // PDM DATA (G2)
#define WS2812_LED_PIN  35  // AtomS3 Lite built-in RGB LED

static CRGB statusLed[1];

inline void setStatusLed(const CRGB& color) {
    statusLed[0] = color;
    FastLED.show();
}

// -- Servers
WiFiServer rtspServer(8554);
WiFiClient rtspClient;
String networkHostname = DEFAULT_NETWORK_HOSTNAME;
bool otaPreviousRtspEnabled = true;

// -- RTSP Streaming
String rtspSessionId = "";
volatile bool isStreaming = false;
uint16_t rtpSequence = 0;
uint32_t rtpTimestamp = 0;
uint32_t rtpSSRC = 0x43215678;
unsigned long lastRTSPActivity = 0;
RtspTransportMode activeRtspTransport = RTSP_TRANSPORT_TCP_INTERLEAVED;
WiFiUDP rtpUdp;
IPAddress rtspUdpClientIp;
uint16_t rtspUdpClientRtpPort = 0;
uint16_t rtspUdpClientRtcpPort = 0;
static const uint16_t RTP_UDP_SERVER_PORT = 6970;
static const uint16_t RTCP_UDP_SERVER_PORT = 6971;

// -- Buffers
uint8_t rtspParseBuffer[1024];
int rtspParseBufferPos = 0;
// Note: Audio buffers now allocated by Core 1 task

// -- Global state
unsigned long audioPacketsSent = 0;
unsigned long audioPacketsDropped = 0;  // Track dropped frames
unsigned long lastStatsReset = 0;
bool rtspServerEnabled = true;

// -- Audio parameters (runtime configurable)
uint32_t currentSampleRate = DEFAULT_SAMPLE_RATE;
float currentGainFactor = DEFAULT_GAIN_FACTOR;
uint16_t currentBufferSize = DEFAULT_BUFFER_SIZE;
// PDM microphones output decimated samples directly
// The hardware PDM decimation produces samples already close to correct range
// Typical range: 0-3 for PDM vs 11-13 for I2S microphones
uint8_t i2sShiftBits = 0;  // Fixed for Unit Mini PDM capture

// -- Audio metering / clipping diagnostics
uint16_t lastPeakAbs16 = 0;       // last block peak absolute value (0..32767)
uint32_t audioClipCount = 0;      // total blocks where clipping occurred
bool audioClippedLastBlock = false; // clipping occurred in last processed block
uint16_t peakHoldAbs16 = 0;       // peak hold (recent window)
unsigned long peakHoldUntilMs = 0; // when to clear hold

// -- I2S raw capture diagnostics (helps verify PDM communication/wiring)
volatile uint32_t i2sReadOkCount = 0;
volatile uint32_t i2sReadErrCount = 0;
volatile uint32_t i2sReadZeroCount = 0;
volatile uint16_t i2sLastSamplesRead = 0;
volatile int16_t i2sLastRawMin = 0;
volatile int16_t i2sLastRawMax = 0;
volatile uint16_t i2sLastRawPeakAbs = 0;
volatile uint16_t i2sLastRawRms = 0;
volatile uint16_t i2sLastRawZeroPct = 0;
volatile bool i2sLikelyUnsignedPcm = false;
volatile uint32_t audioFallbackBlockCount = 0;
volatile uint32_t i2sLastGapMs = 0;
volatile float audioPipelineLoadPct = 0.0f;

