matthew73210/birdnetgo-m5stack-atom-echo-rtsp-mic/src/esp32_rtsp_mic_birdnetgo.cpp
// -- Lightweight spectrum diagnostics for Web UI waterfall
volatile uint8_t fftBins[32] = {0};
volatile uint32_t fftFrameSeq = 0;

// -- Browser WebAudio diagnostics stream (latest processed PCM block)
portMUX_TYPE webAudioMux = portMUX_INITIALIZER_UNLOCKED;
volatile uint32_t webAudioFrameSeq = 0;
volatile uint16_t webAudioFrameSamples[WEB_AUDIO_FRAME_RING_LEN] = {0};
volatile uint32_t webAudioSampleRate[WEB_AUDIO_FRAME_RING_LEN] = {0};
volatile uint32_t webAudioRingSeq[WEB_AUDIO_FRAME_RING_LEN] = {0};
int16_t webAudioFrame[WEB_AUDIO_FRAME_RING_LEN][WEB_AUDIO_FRAME_MAX_SAMPLES] = {{0}};

// -- Lightweight telemetry history for Web UI graphs
portMUX_TYPE telemetryMux = portMUX_INITIALIZER_UNLOCKED;
static const uint16_t TELEMETRY_HISTORY_LEN = 120;
volatile uint32_t telemetryHistorySeq = 0;
uint8_t telemetryCpuLoadPct[TELEMETRY_HISTORY_LEN] = {0};
int16_t telemetryTempDeciC[TELEMETRY_HISTORY_LEN] = {0};
uint16_t telemetryHistoryHead = 0;
uint16_t telemetryHistoryCount = 0;

// -- LED mode: 0=off, 1=static, 2=level
uint8_t ledMode = 1;  // Default: static purple during streaming

// -- Automatic Gain Control (AGC)
bool agcEnabled = false;
volatile float agcMultiplier = 1.0f;   // Current AGC multiplier (read by WebUI)
const float AGC_TARGET_RMS = 0.10f;    // Conservative target RMS (~-20 dBFS) to avoid constant hot audio
const float AGC_MIN_MULT = 0.1f;
const float AGC_MAX_MULT = 6.0f;       // Keep AGC from driving persistent background noise too hard
const float AGC_ATTACK_RATE = 0.05f;   // Fast attack (gain reduction) per buffer
const float AGC_RELEASE_RATE = 0.001f; // Slow release (gain increase) per buffer

// -- Adaptive background-noise filter (auto gate/bed suppression)
// Tuned to avoid the old "tap tap tap" artifact caused by per-sample gain pumping.
volatile bool noiseFilterEnabled = true;
volatile float noiseFloorDbfs = -90.0f;
volatile float noiseGateDbfs = -90.0f;
volatile float noiseReductionDb = 0.0f;
const float NOISE_FLOOR_INIT = 300.0f;
const float NOISE_FLOOR_FAST = 0.015f;
const float NOISE_FLOOR_SLOW = 0.0008f;
const float NOISE_GATE_RATIO = 2.6f;
const float NOISE_GATE_MARGIN = 220.0f;
const float NOISE_GATE_MIN = 220.0f;
const float NOISE_GATE_MAX = 5200.0f;
const float NOISE_GATE_CLOSE_RATIO = 0.72f;
const float NOISE_FILTER_MIN_GAIN = 0.55f;
const float NOISE_FILTER_ATTACK = 0.006f;
const float NOISE_FILTER_RELEASE = 0.0008f;
const float NOISE_FILTER_REOPEN = 0.0035f;
const float NOISE_ENV_ATTACK = 0.010f;
const float NOISE_ENV_RELEASE = 0.0012f;
const uint16_t NOISE_GATE_HOLD_MS = 120;
const char* DEVICE_TITLE = "M5 Atom RTSP Microphone";
const char* DEVICE_INPUT_PROFILE = "PDM input profile (AtomS3 Lite + Unit Mini PDM tuned)";
const char* FILTER_CHAIN_BASE = "Input normalize -> 2nd-order Butterworth high-pass -> adaptive noise bed suppressor -> manual gain -> limiter -> optional AGC";

// -- High-pass filter (biquad) to cut low-frequency rumble
struct Biquad {
    float b0{1.0f}, b1{0.0f}, b2{0.0f}, a1{0.0f}, a2{0.0f};
    float x1{0.0f}, x2{0.0f}, y1{0.0f}, y2{0.0f};
    inline float process(float x) {
        float y = b0 * x + b1 * x1 + b2 * x2 - a1 * y1 - a2 * y2;
        x2 = x1; x1 = x; y2 = y1; y1 = y;
        return y;
    }
    inline void reset() { x1 = x2 = y1 = y2 = 0.0f; }
};
bool highpassEnabled = DEFAULT_HPF_ENABLED;
uint16_t highpassCutoffHz = DEFAULT_HPF_CUTOFF_HZ;
Biquad hpf;
uint32_t hpfConfigSampleRate = 0;
uint16_t hpfConfigCutoff = 0;

// -- Preferences for persistent settings
Preferences audioPrefs;

// -- Diagnostics, auto-recovery and temperature monitoring
unsigned long lastMemoryCheck = 0;
unsigned long lastPerformanceCheck = 0;
unsigned long lastWiFiCheck = 0;
unsigned long lastTempCheck = 0;
unsigned long lastTelemetrySampleMs = 0;
uint32_t minFreeHeap = 0xFFFFFFFF;
uint32_t maxPacketRate = 0;
uint32_t minPacketRate = 0xFFFFFFFF;
bool autoRecoveryEnabled = false;
bool autoThresholdEnabled = true; // auto compute minAcceptableRate from sample rate and buffer size
// Deferred reboot scheduling (to restart safely outside HTTP context)
volatile bool scheduledFactoryReset = false;
volatile unsigned long scheduledRebootAt = 0;
unsigned long bootTime = 0;
unsigned long lastI2SReset = 0;
float maxTemperature = 0.0f;
float lastTemperatureC = 0.0f;
bool lastTemperatureValid = false;
bool overheatProtectionEnabled = DEFAULT_OVERHEAT_PROTECTION;
float overheatShutdownC = (float)DEFAULT_OVERHEAT_LIMIT_C;
bool overheatLockoutActive = false;
float overheatTripTemp = 0.0f;
unsigned long overheatTriggeredAt = 0;
String overheatLastReason = "";
String overheatLastTimestamp = "";
bool overheatSensorFault = false;
bool overheatLatched = false;

// -- Scheduled reset
bool scheduledResetEnabled = false;
uint32_t resetIntervalHours = 24; // Default 24 hours

// -- Configurable thresholds
uint32_t minAcceptableRate = 50;        // Minimum acceptable packet rate (restart below this)
uint32_t performanceCheckInterval = 15; // Check interval in minutes
uint8_t cpuFrequencyMhz = 160;          // CPU frequency (default 160 MHz — sufficient for this workload)

// -- WiFi TX power (configurable)
float wifiTxPowerDbm = DEFAULT_WIFI_TX_DBM;
wifi_power_t currentWifiPowerLevel = WIFI_POWER_19_5dBm;

// -- RTSP connect/PLAY statistics
unsigned long lastRtspClientConnectMs = 0;
unsigned long lastRtspPlayMs = 0;
uint32_t rtspConnectCount = 0;
uint32_t rtspPlayCount = 0;

// ===============================================

static const char* rtspTransportModeName(RtspTransportMode mode) {
    switch (mode) {
        case RTSP_TRANSPORT_UDP_UNICAST: return "udp";
        case RTSP_TRANSPORT_TCP_INTERLEAVED:
        default: return "tcp";
    }
}

const char* currentRtspTransportName() {
    return rtspTransportModeName(activeRtspTransport);
}

static String extractRtspHeader(const String &request, const char* headerName) {
    String needle = String("\r\n") + headerName;
    int start = request.indexOf(needle);
    if (start < 0 && request.startsWith(String(headerName))) {
        start = 0;
    } else if (start >= 0) {
        start += 2;
    }
    if (start < 0) return String("");
    int colon = request.indexOf(':', start);
    if (colon < 0) return String("");
    int end = request.indexOf("\r\n", colon);
    if (end < 0) end = request.length();
    String value = request.substring(colon + 1, end);
    value.trim();
    return value;
}

