matthew73210/birdnetgo-m5stack-atom-echo-rtsp-mic/src/esp32_rtsp_mic_birdnetgo.cpp
    if (dmaBufLen > 512) dmaBufLen = 512;
    return dmaBufLen;
}

static uint8_t computeI2sDmaBufferCount() {
    return 8;
}

static uint16_t computeI2sReadBufferSamples() {
    // ESP-IDF guidance for polling reads is to make the application read buffer
    // larger than the total DMA ring so a read cycle can fully drain capture.
    const uint32_t dmaRingSamples = (uint32_t)computeI2sDmaBufferLen() * (uint32_t)computeI2sDmaBufferCount();
    uint32_t readSamples = dmaRingSamples + computeI2sDmaBufferLen();
    if (readSamples < effectiveAudioChunkSize()) readSamples = effectiveAudioChunkSize();
    if (readSamples > WEB_AUDIO_FRAME_MAX_SAMPLES) readSamples = WEB_AUDIO_FRAME_MAX_SAMPLES;
    return (uint16_t)readSamples;
}

// Compute recommended minimum packet-rate threshold based on the effective stream chunk size
uint32_t computeRecommendedMinRate() {
    uint32_t buf = max((uint16_t)1, effectiveAudioChunkSize());
    float expectedPktPerSec = (float)currentSampleRate / (float)buf;
    uint32_t rec = (uint32_t)(expectedPktPerSec * 0.5f + 0.5f); // 50% safety margin
    if (rec < 5) rec = 5;
    return rec;
}

// Restore application settings to safe defaults and persist
void resetToDefaultSettings() {
    simplePrintln("FACTORY RESET: Restoring default settings...");

    // Clear persisted settings in our namespace
    audioPrefs.begin("audio", false);
    audioPrefs.clear();
    audioPrefs.end();

    // Reset runtime variables to defaults
    currentSampleRate = DEFAULT_SAMPLE_RATE;
    currentGainFactor = DEFAULT_GAIN_FACTOR;
    currentBufferSize = DEFAULT_BUFFER_SIZE;
    i2sShiftBits = 0;  // Fixed for Unit Mini PDM capture

    autoRecoveryEnabled = false;
    autoThresholdEnabled = true;
    scheduledResetEnabled = false;
    resetIntervalHours = 24;
    minAcceptableRate = computeRecommendedMinRate();
    performanceCheckInterval = 15;
    cpuFrequencyMhz = 160;
    wifiTxPowerDbm = DEFAULT_WIFI_TX_DBM;
    highpassEnabled = DEFAULT_HPF_ENABLED;
    highpassCutoffHz = DEFAULT_HPF_CUTOFF_HZ;
    agcEnabled = false;
    agcMultiplier = 1.0f;
    noiseFilterEnabled = true;
    noiseFloorDbfs = -90.0f;
    noiseGateDbfs = -90.0f;
    noiseReductionDb = 0.0f;
    ledMode = 1;
    overheatProtectionEnabled = DEFAULT_OVERHEAT_PROTECTION;
    overheatShutdownC = (float)DEFAULT_OVERHEAT_LIMIT_C;
    overheatLockoutActive = false;
    overheatTripTemp = 0.0f;
    overheatTriggeredAt = 0;
    overheatLastReason = "";
    overheatLastTimestamp = "";
    overheatSensorFault = false;
    overheatLatched = false;
    lastTemperatureC = 0.0f;
    lastTemperatureValid = false;

    isStreaming = false;

    saveAudioSettings();

    simplePrintln("Defaults applied. Device will reboot.");
}

// Restart I2S with new parameters
void restartI2S() {
    simplePrintln("Restarting I2S with new parameters...");
    bool wasStreaming = isStreaming;

    // Request Core 1 to stop streaming safely
    if (isStreaming) {
        requestStreamStop("I2S restart");
    }

    // Stop audio pipeline task on Core 1
    stopAudioCaptureTask();

    // Restart I2S driver
    setup_i2s_driver();

    // Refresh HPF with current parameters
    updateHighpassCoeffs();
    maxPacketRate = 0;
    minPacketRate = 0xFFFFFFFF;

    // If we were streaming, restart the pipeline with the existing client
    if (wasStreaming && rtspClient && rtspClient.connected()) {
        streamClient = &rtspClient;
        isStreaming = true;
        startAudioCaptureTask();
        simplePrintln("I2S restarted, streaming resumed");
    } else {
        simplePrintln("I2S restarted");
    }
}

// Minimal print helpers: Serial + buffered for Web UI
// Timestamp prefix for log messages (NTP time if available, uptime fallback)
static bool timeIsSynced() {
    time_t now = 0;
    time(&now);
    return now > 100000;
}

static String logTimestamp() {
    time_t now = 0;
    time(&now);
    if (timeIsSynced()) {
        struct tm ti;
        gmtime_r(&now, &ti);
        char buf[24];
        strftime(buf, sizeof(buf), "[%H:%M:%S] ", &ti);
        return String(buf);
    }
    // Fallback: uptime
    unsigned long s = (millis() - bootTime) / 1000;
    unsigned long h = s / 3600; s %= 3600;
    unsigned long m = s / 60; s %= 60;
    char buf[16];
    snprintf(buf, sizeof(buf), "[%02lu:%02lu:%02lu] ", h, m, s);
    return String(buf);
}

void simplePrint(String message) {
    Serial.print(logTimestamp() + message);
}

void simplePrintln(String message) {
    String stamped = logTimestamp() + message;
    Serial.println(stamped);
    webui_pushLog(stamped);
}

static void resumeRtspServerAfterOtaFailure() {
    if (overheatLatched) {
        rtspServerEnabled = false;
        rtspServer.stop();
        return;
    }
    if (!rtspServerEnabled) return;
    rtspServer.stop();
    delay(20);
    rtspServer.begin();
    rtspServer.setNoDelay(true);
}

static void setupArduinoOta() {
    ArduinoOTA.setHostname(networkHostname.c_str());
    ArduinoOTA.setPort(OTA_PORT);

    ArduinoOTA.onStart([]() {
        const char* updateType = (ArduinoOTA.getCommand() == U_FLASH) ? "firmware" : "filesystem";
        simplePrintln(String("OTA start: ") + updateType + " update requested");
        otaPreviousRtspEnabled = rtspServerEnabled;
        if (isStreaming) {
            requestStreamStop("OTA update");
        }
        stopAudioCaptureTask();
        rtspServer.stop();
        rtspServerEnabled = false;
        core1OwnsLED = false;
        setStatusLed(CRGB(128, 0, 128));
    });

    ArduinoOTA.onEnd([]() {
        simplePrintln("OTA update complete, rebooting");
        setStatusLed(CRGB(0, 128, 0));
    });

    ArduinoOTA.onProgress([](unsigned int progress, unsigned int total) {
        static uint8_t lastPercent = 255;
        uint8_t percent = total ? (progress * 100U) / total : 0;
        if (percent != lastPercent && (percent == 0 || percent == 100 || (percent % 10) == 0)) {
            simplePrintln("OTA progress: " + String(percent) + "%");
            lastPercent = percent;
        }
    });

    ArduinoOTA.onError([](ota_error_t error) {
        String reason = "unknown";
        switch (error) {
            case OTA_AUTH_ERROR:    reason = "auth failed"; break;
            case OTA_BEGIN_ERROR:   reason = "begin failed"; break;
            case OTA_CONNECT_ERROR: reason = "connect failed"; break;
            case OTA_RECEIVE_ERROR: reason = "receive failed"; break;
            case OTA_END_ERROR:     reason = "end failed"; break;
            default: break;
        }
        simplePrintln("OTA error: " + reason);
        startAudioCaptureTask();
        rtspServerEnabled = otaPreviousRtspEnabled;
        resumeRtspServerAfterOtaFailure();
        if (ledMode > 0) setStatusLed(CRGB(0, 0, 128));
        else setStatusLed(CRGB(0, 0, 0));
    });

    ArduinoOTA.begin();
    simplePrintln("OTA ready: pio run -e m5stack-atoms3-lite-ota -t upload");
    simplePrintln("OTA target: " + networkHostname + ".local:" + String(OTA_PORT));
}

