matthew73210/birdnetgo-m5stack-atom-echo-rtsp-mic/src/esp32_rtsp_mic_birdnetgo.cpp
        // Update HPF coefficients if changed
        if (highpassEnabled && (localHpfConfigSampleRate != currentSampleRate ||
                                localHpfConfigCutoff != highpassCutoffHz)) {
            localHpf = hpf;
            localHpfConfigSampleRate = currentSampleRate;
            localHpfConfigCutoff = highpassCutoffHz;
        }

        // Determine effective gain (manual * AGC if enabled)
        float effectiveGain = currentGainFactor;
        if (agcEnabled) {
            effectiveGain *= localAgcMult;
        }
        if (localLimiterGain < 1.0f) {
            localLimiterGain += (1.0f - localLimiterGain) * LIMITER_RELEASE;
            if (localLimiterGain > 1.0f) localLimiterGain = 1.0f;
        }

        // Process audio: HPF, adaptive noise filter, gain, limiter, clipping detection, RMS for AGC
        bool clipped = false;
        float peakAbs = 0.0f;
        float sumSquares = 0.0f;

        // Raw I2S diagnostics before DSP (used to detect dead/flat/stuck mic input)
        int16_t rawMin = INT16_MAX;
        int16_t rawMax = INT16_MIN;
        uint16_t rawPeakAbs = 0;
        uint32_t rawZeroCount = 0;
        float rawSumSquares = 0.0f;

        // First pass: collect raw stats for diagnostics and format detection.
        for (int i = 0; i < samplesRead; i++) {
            int16_t raw = captureBuffer[i];
            if (raw < rawMin) rawMin = raw;
            if (raw > rawMax) rawMax = raw;
            uint16_t rawAbs = (raw < 0) ? (uint16_t)(-raw) : (uint16_t)raw;
            if (rawAbs > rawPeakAbs) rawPeakAbs = rawAbs;
            if (raw == 0) rawZeroCount++;
            rawSumSquares += (float)raw * (float)raw;
        }

        // Some PDM front-ends return unsigned low-amplitude PCM (e.g. around 1024)
        // instead of signed 16-bit centered at 0. Detect and normalize per block.
        bool likelyUnsignedPdm = (rawMin >= 0 && rawMax <= 4095);
        i2sLikelyUnsignedPcm = likelyUnsignedPdm;
        float pdmCenter = 0.0f;
        float pdmScale = 1.0f;
        if (likelyUnsignedPdm) {
            pdmCenter = (rawMax > 2047) ? 2048.0f : 1024.0f;
            pdmScale = (rawMax > 2047) ? 16.0f : 32.0f;
        }

        // Second pass: DSP and output generation.
        for (int i = 0; i < samplesRead; i++) {
            int16_t raw = captureBuffer[i];

            float sample = likelyUnsignedPdm
                ? ((float)raw - pdmCenter) * pdmScale
                : (float)(raw >> i2sShiftBits);

            if (highpassEnabled) {
                sample = localHpf.process(sample);
            }

            float sampleAbs = fabsf(sample);
            if (noiseFilterEnabled) {
                float prevNoiseEnv = localNoiseEnv;
                float envSlew = (sampleAbs > localNoiseEnv) ? NOISE_ENV_ATTACK : NOISE_ENV_RELEASE;
                localNoiseEnv += (sampleAbs - localNoiseEnv) * envSlew;

                float floorFollow = (localNoiseEnv <= localNoiseGate) ? NOISE_FLOOR_FAST : NOISE_FLOOR_SLOW;
                localNoiseFloor += (localNoiseEnv - localNoiseFloor) * floorFollow;
                if (localNoiseFloor < 0.0f) localNoiseFloor = 0.0f;
                localNoiseGate = localNoiseFloor * NOISE_GATE_RATIO + NOISE_GATE_MARGIN;
                if (localNoiseGate < NOISE_GATE_MIN) localNoiseGate = NOISE_GATE_MIN;
                if (localNoiseGate > NOISE_GATE_MAX) localNoiseGate = NOISE_GATE_MAX;

                uint32_t holdSamples = ((uint32_t)currentSampleRate * NOISE_GATE_HOLD_MS) / 1000UL;
                if (holdSamples < 1) holdSamples = 1;

                if (localNoiseEnv >= localNoiseGate) {
                    localNoiseGateHoldSamples = holdSamples;
                } else if (localNoiseGateHoldSamples > 0) {
                    localNoiseGateHoldSamples--;
                }

                float desiredNoiseGain = 1.0f;
                float closeThreshold = localNoiseGate * NOISE_GATE_CLOSE_RATIO;
                if (localNoiseGateHoldSamples == 0 && localNoiseGate > 1.0f && localNoiseEnv < closeThreshold) {
                    float normalized = localNoiseEnv / closeThreshold;
                    if (normalized < 0.0f) normalized = 0.0f;
                    if (normalized > 1.0f) normalized = 1.0f;
                    desiredNoiseGain = NOISE_FILTER_MIN_GAIN + (1.0f - NOISE_FILTER_MIN_GAIN) * normalized * normalized;
                }

                bool onsetDetected = (sampleAbs > prevNoiseEnv) &&
                                    ((localNoiseGateHoldSamples > 0) || (localNoiseEnv >= closeThreshold));
                float noiseSlew = (desiredNoiseGain < localNoiseGain) ? NOISE_FILTER_ATTACK : NOISE_FILTER_RELEASE;
                if (desiredNoiseGain >= 0.999f && localNoiseGain < 0.999f && onsetDetected) {
                    noiseSlew = NOISE_FILTER_REOPEN;
                }
                localNoiseGain += (desiredNoiseGain - localNoiseGain) * noiseSlew;
                if (localNoiseGain < NOISE_FILTER_MIN_GAIN) localNoiseGain = NOISE_FILTER_MIN_GAIN;
                if (localNoiseGain > 1.0f) localNoiseGain = 1.0f;
                sample *= localNoiseGain;
                localNoiseReduction = 20.0f * log10f(max(localNoiseGain, 0.0001f));
            } else {
                localNoiseGain = 1.0f;
                localNoiseEnv = 0.0f;
                localNoiseGateHoldSamples = 0;
                localNoiseReduction = 0.0f;
            }

            float amplified = sample * effectiveGain * localLimiterGain;
            float aabs = fabsf(amplified);
            if (aabs > LIMITER_TARGET_PEAK && aabs > 1.0f) {
                float neededGain = LIMITER_TARGET_PEAK / aabs;
                localLimiterGain *= neededGain;
                if (localLimiterGain < LIMITER_MIN_GAIN) localLimiterGain = LIMITER_MIN_GAIN;
                amplified = sample * effectiveGain * localLimiterGain;
                aabs = fabsf(amplified);
            }
            if (aabs > peakAbs) peakAbs = aabs;
            if (aabs > 32767.0f) clipped = true;
            sumSquares += amplified * amplified;

            if (amplified > 32767.0f) amplified = 32767.0f;
            if (amplified < -32768.0f) amplified = -32768.0f;
            outputBuffer[i] = (int16_t)amplified;
        }
        if (samplesRead > 0) {
            lastOutputSample = outputBuffer[samplesRead - 1];
        }

        // Publish latest processed frame for browser WebAudio endpoint
        uint16_t publishSamples = samplesRead;
        if (publishSamples > WEB_AUDIO_FRAME_MAX_SAMPLES) publishSamples = WEB_AUDIO_FRAME_MAX_SAMPLES;
        portENTER_CRITICAL(&webAudioMux);
        uint32_t nextWebAudioSeq = webAudioFrameSeq + 1U;
        uint8_t webAudioSlot = (uint8_t)((nextWebAudioSeq - 1U) % WEB_AUDIO_FRAME_RING_LEN);
        memcpy(webAudioFrame[webAudioSlot], outputBuffer, publishSamples * sizeof(int16_t));
        webAudioFrameSamples[webAudioSlot] = publishSamples;
        webAudioSampleRate[webAudioSlot] = currentSampleRate;
        webAudioRingSeq[webAudioSlot] = nextWebAudioSeq;
        webAudioFrameSeq = nextWebAudioSeq;
        portEXIT_CRITICAL(&webAudioMux);

        // Update spectrum diagnostics from processed output (throttled)
        static uint8_t fftDecimator = 0;
        fftDecimator++;
        if ((fftDecimator & 0x03) == 0 && samplesRead >= 128) {
            updateFftFromBlock(outputBuffer, samplesRead);
        }

