matthew73210/birdnetgo-m5stack-atom-echo-rtsp-mic/src/esp32_rtsp_mic_birdnetgo.cpp
        // Publish raw capture diagnostics for UI/API
        i2sLastRawMin = rawMin;
        i2sLastRawMax = rawMax;
        i2sLastRawPeakAbs = rawPeakAbs;
        if (samplesRead > 0) {
            float rawRms = sqrtf(rawSumSquares / (float)samplesRead);
            if (rawRms > 65535.0f) rawRms = 65535.0f;
            i2sLastRawRms = (uint16_t)rawRms;
            i2sLastRawZeroPct = (uint16_t)((rawZeroCount * 100UL) / samplesRead);
        } else {
            i2sLastRawRms = 0;
            i2sLastRawZeroPct = 100;
        }

        // AGC: adjust multiplier based on RMS
        if (agcEnabled && samplesRead > 0) {
            float rms = sqrtf(sumSquares / (float)samplesRead) / 32767.0f;
            if (rms > 0.001f) {  // Don't adjust on silence
                float ratio = AGC_TARGET_RMS / rms;
                if (ratio < 1.0f) {
                    // Signal too loud — fast attack (reduce gain quickly)
                    localAgcMult += (ratio - 1.0f) * AGC_ATTACK_RATE * localAgcMult;
                } else {
                    // Signal too quiet — slow release (increase gain slowly)
                    localAgcMult += (ratio - 1.0f) * AGC_RELEASE_RATE * localAgcMult;
                }
                if (localAgcMult < AGC_MIN_MULT) localAgcMult = AGC_MIN_MULT;
                if (localAgcMult > AGC_MAX_MULT) localAgcMult = AGC_MAX_MULT;
            }
            agcMultiplier = localAgcMult;  // Publish for WebUI
        }

        if (noiseFilterEnabled) {
            float floorNorm = max(localNoiseFloor, 1.0f) / 32767.0f;
            float gateNorm = max(localNoiseGate, 1.0f) / 32767.0f;
            noiseFloorDbfs = 20.0f * log10f(floorNorm);
            noiseGateDbfs = 20.0f * log10f(gateNorm);
            noiseReductionDb = localNoiseReduction;
        } else {
            noiseFloorDbfs = -90.0f;
            noiseGateDbfs = -90.0f;
            noiseReductionDb = 0.0f;
        }

        // Update metering
        if (peakAbs > 32767.0f) peakAbs = 32767.0f;
        lastPeakAbs16 = (uint16_t)peakAbs;
        audioClippedLastBlock = clipped;
        if (clipped) {
            audioClipCount++;
            static unsigned long lastClipLog = 0;
            if (millis() - lastClipLog > 5000) {
                Serial.printf("[Core1] Clipping! Peak=%u count=%lu\n",
                             lastPeakAbs16, audioClipCount);
                lastClipLog = millis();
            }
        }

        if (lastPeakAbs16 > peakHoldAbs16) {
            peakHoldAbs16 = lastPeakAbs16;
            peakHoldUntilMs = millis() + 3000UL;
        } else if (peakHoldAbs16 > 0 && millis() > peakHoldUntilMs) {
            peakHoldAbs16 = 0;
        }

        // LED update (throttled to ~10 Hz) only while actively streaming.
        if (streamActive && millis() - lastLedUpdate > 100) {
            if (ledMode == 2) {
                // Level mode: color-coded audio level
                float pct = peakAbs / 32767.0f;
                if (clipped) {
                    setStatusLed(CRGB(255, 0, 0));        // Red: clipping
                } else if (pct > 0.7f) {
                    setStatusLed(CRGB(255, 165, 0));      // Orange: hot signal
                } else if (pct > 0.3f) {
                    setStatusLed(CRGB(0, 255, 0));        // Bright green: good level
                } else if (pct > 0.05f) {
                    setStatusLed(CRGB(0, 64, 0));         // Dim green: low signal
                } else {
                    setStatusLed(CRGB(32, 0, 32));        // Dim purple: very quiet
                }
            } else if (ledMode == 1) {
                // Static mode: solid green during streaming
                setStatusLed(CRGB(0, 128, 0));
            } else {
                // Off mode: LED dark during streaming
                setStatusLed(CRGB(0, 0, 0));
            }
            lastLedUpdate = millis();
        }

        if (streamActive) {
            // Send RTP packet
            sendRTPPacket(*client, outputBuffer, samplesRead);
            packetCount++;
        }

        float blockMs = (1000.0f * (float)max((uint16_t)1, samplesRead)) / max((float)currentSampleRate, 1.0f);
        float workMs = (float)(micros() - processStartUs) / 1000.0f;
        float instLoad = (blockMs > 0.0f) ? (workMs * 100.0f / blockMs) : 0.0f;
        if (instLoad > 100.0f) instLoad = 100.0f;
        audioPipelineLoadPct += (instLoad - audioPipelineLoadPct) * 0.15f;

        // Process incoming RTSP commands during streaming (~every 200ms)
        // Keeps all socket I/O on Core 1 during streaming
        static unsigned long lastRtspCheck = 0;
        if (streamActive && (millis() - lastRtspCheck > 200)) {
            lastRtspCheck = millis();
            if (client->available() > 0) {
                char rtspBuf[512];
                int avail = client->available();
                if (avail > (int)sizeof(rtspBuf) - 1) avail = sizeof(rtspBuf) - 1;
                int n = client->read((uint8_t*)rtspBuf, avail);
                if (n > 0) {
                    rtspBuf[n] = '\0';
                    // Parse for RTSP commands
                    if (strstr(rtspBuf, "TEARDOWN") != NULL) {
                        // Extract CSeq
                        const char* cseqStr = strstr(rtspBuf, "CSeq: ");
                        int cseqVal = 1;
                        if (cseqStr) cseqVal = atoi(cseqStr + 6);
                        // Send response (Core 1 owns the socket)
                        char resp[128];
                        int rlen = snprintf(resp, sizeof(resp),
                            "RTSP/1.0 200 OK\r\nCSeq: %d\r\n\r\n", cseqVal);
                        client->write((uint8_t*)resp, rlen);
                        // Close and clean up
                        client->stop();
                        streamClient = NULL;
                        isStreaming = false;
                        core1OwnsLED = false;
                        Serial.println("[Core1] TEARDOWN received, stream stopped");
                    } else if (strstr(rtspBuf, "GET_PARAMETER") != NULL) {
                        const char* cseqStr = strstr(rtspBuf, "CSeq: ");
                        int cseqVal = 1;
                        if (cseqStr) cseqVal = atoi(cseqStr + 6);
                        char resp[128];
                        int rlen = snprintf(resp, sizeof(resp),
                            "RTSP/1.0 200 OK\r\nCSeq: %d\r\n\r\n", cseqVal);
                        client->write((uint8_t*)resp, rlen);
                        lastRTSPActivity = millis();
                    }
                    // Other commands silently discarded
                }
            }
        }

        taskYIELD();
    }

    free(captureBuffer);
    free(outputBuffer);
    core1OwnsLED = false;
    audioTaskRunning = false;
    Serial.println("[Core1] Audio pipeline task stopped");
    xSemaphoreGive(taskExitSemaphore);
    vTaskDelete(NULL);
}

// Start audio pipeline task on Core 1 (or reuse if already running)
void startAudioCaptureTask() {
    if (audioCaptureTaskHandle != NULL) {
        // Task already alive — it will pick up via isStreaming/streamClient
        return;
    }

