matthew73210/birdnetgo-m5stack-atom-echo-rtsp-mic/src/esp32_rtsp_mic_birdnetgo.cpp
    BaseType_t result = xTaskCreatePinnedToCore(
        audioCaptureTask,           // Task function
        "AudioPipeline",            // Name
        8192,                       // Stack size
        NULL,                       // Parameters
        10,                         // Priority (elevated)
        &audioCaptureTaskHandle,    // Task handle
        1                           // Core 1 (PRO_CPU)
    );

    if (result != pdPASS) {
        simplePrintln("[Core1] FATAL: Failed to create audio pipeline task!");
    }
}

// Stop audio pipeline task with confirmed exit via semaphore
void stopAudioCaptureTask() {
    if (audioCaptureTaskHandle != NULL) {
        audioTaskRunning = false;
        // Wait for task to confirm exit (up to 2s)
        if (xSemaphoreTake(taskExitSemaphore, pdMS_TO_TICKS(2000)) != pdTRUE) {
            Serial.println("[Core0] WARNING: Audio task did not exit within 2s");
        }
        audioCaptureTaskHandle = NULL;
    }
}

// Request Core 1 to stop streaming and clean up the socket.
// Core 0 must NOT touch the WiFiClient while Core 1 owns it.
// Returns true if Core 1 confirmed cleanup, false on timeout.
bool requestStreamStop(const char* reason) {
    // Early return if not streaming
    if (!isStreaming && streamClient == NULL) return true;

    Serial.printf("[Core0] requestStreamStop: %s\n", reason);

    // Signal Core 1 to stop
    stopStreamRequested = true;
    __asm__ __volatile__("memw" ::: "memory");  // Xtensa memory barrier

    // Poll for Core 1 confirmation (up to 3s)
    unsigned long deadline = millis() + 3000;
    while (!streamCleanupDone && millis() < deadline) {
        vTaskDelay(pdMS_TO_TICKS(10));
    }

    if (streamCleanupDone) {
        // Core 1 confirmed — safe to proceed
        isStreaming = false;
        streamClient = NULL;
        stopStreamRequested = false;
        streamCleanupDone = false;
        Serial.printf("[Core0] Stream stopped cleanly: %s\n", reason);
        return true;
    } else {
        // Timeout — force cleanup
        Serial.printf("[Core0] WARNING: Stream stop timeout, forcing cleanup: %s\n", reason);
        isStreaming = false;
        streamClient = NULL;
        stopStreamRequested = false;
        streamCleanupDone = false;
        core1OwnsLED = false;
        return false;
    }
}

// I2S setup for AtomS3 Lite + Unit Mini PDM (PDM microphone mode)
void setup_i2s_driver() {
    i2s_driver_uninstall(I2S_NUM_0);

    const uint16_t dma_buf_len = computeI2sDmaBufferLen();
    const uint8_t dma_buf_count = computeI2sDmaBufferCount();

    i2s_config_t i2s_config = {
        // PDM mode for Unit Mini PDM microphone
        .mode = (i2s_mode_t)(I2S_MODE_MASTER | I2S_MODE_RX | I2S_MODE_PDM),
        .sample_rate = currentSampleRate,
        .bits_per_sample = I2S_BITS_PER_SAMPLE_16BIT,  // Match original demo exactly
        .channel_format = I2S_CHANNEL_FMT_ONLY_RIGHT,   // Match M5 reference PDM example
#if ESP_IDF_VERSION > ESP_IDF_VERSION_VAL(4, 1, 0)
        .communication_format = I2S_COMM_FORMAT_STAND_I2S,
#else
        .communication_format = I2S_COMM_FORMAT_I2S,
#endif
        .intr_alloc_flags = ESP_INTR_FLAG_LEVEL1,
        .dma_buf_count = dma_buf_count,
        .dma_buf_len = dma_buf_len,
        .use_apll = false,
        .tx_desc_auto_clear = false,
        .fixed_mclk = 0
    };

    i2s_pin_config_t pin_config = {
#if (ESP_IDF_VERSION > ESP_IDF_VERSION_VAL(4, 3, 0))
        .mck_io_num = I2S_PIN_NO_CHANGE,
#endif
        .bck_io_num = I2S_PIN_NO_CHANGE,
        .ws_io_num = I2S_CLK_PIN,
        .data_out_num = I2S_PIN_NO_CHANGE,
        .data_in_num = I2S_DATA_IN_PIN
    };

    i2s_driver_install(I2S_NUM_0, &i2s_config, 0, NULL);
    i2s_set_pin(I2S_NUM_0, &pin_config);
    i2s_set_clk(I2S_NUM_0, currentSampleRate, I2S_BITS_PER_SAMPLE_16BIT, I2S_CHANNEL_MONO);

    simplePrintln("I2S ready (PDM mode): " + String(currentSampleRate) + "Hz, gain " +
                  String(currentGainFactor, 1) + ", buffer " + String(currentBufferSize) +
                  " (chunk " + String(effectiveAudioChunkSize()) + ")" +
                  ", dma " + String(dma_buf_count) + "x" + String(dma_buf_len) +
                  ", read " + String(computeI2sReadBufferSamples()) +
                  ", shiftBits " + String(i2sShiftBits));
}

static bool writeAll(WiFiClient &client, const uint8_t* data, size_t len, unsigned long timeoutMs) {
    size_t off = 0;
    unsigned long startTime = millis();

    while (off < len) {
        // Check timeout to prevent blocking Core 1
        if (millis() - startTime > timeoutMs) {
            // Drop frame if WiFi is too slow (normal with poor signal)
            return false;
        }

        int w = client.write(data + off, len - off);
        if (w <= 0) return false;
        off += (size_t)w;
    }
    return true;
}

static uint32_t consecutiveWriteFailures = 0;
static const uint32_t MAX_WRITE_FAILURES = 100;  // Allow ~5s of failures before disconnect

void sendRTPPacket(WiFiClient &client, int16_t* audioData, int numSamples) {
    if (!client.connected()) {
        // Client disconnected — Core 1 owns the socket, close it
        client.stop();
        rtpUdp.stop();
        streamClient = NULL;
        isStreaming = false;
        core1OwnsLED = false;
        return;
    }

    const int maxSamplesPerPacket = (int)effectiveAudioChunkSize();
    int offsetSamples = 0;
    while (offsetSamples < numSamples) {
        const int packetSamples = min(maxSamplesPerPacket, numSamples - offsetSamples);
        const uint16_t payloadSize = (uint16_t)(packetSamples * (int)sizeof(int16_t));
        const uint16_t packetSize = (uint16_t)(12 + payloadSize);
        const unsigned long packetWindowMs = max(40UL, min(140UL, (unsigned long)(((uint32_t)packetSamples * 1000UL) / max((uint32_t)1, currentSampleRate)) * 2UL));
        uint8_t packetBuffer[12 + (1024 * sizeof(int16_t))];

        // RTP header (12 bytes) + network-order PCM payload in one contiguous buffer.
        packetBuffer[0] = 0x80;      // V=2, P=0, X=0, CC=0
        packetBuffer[1] = 96;        // M=0, PT=96 (dynamic)
        packetBuffer[2] = (uint8_t)((rtpSequence >> 8) & 0xFF);
        packetBuffer[3] = (uint8_t)(rtpSequence & 0xFF);
        packetBuffer[4] = (uint8_t)((rtpTimestamp >> 24) & 0xFF);
        packetBuffer[5] = (uint8_t)((rtpTimestamp >> 16) & 0xFF);
        packetBuffer[6] = (uint8_t)((rtpTimestamp >> 8) & 0xFF);
        packetBuffer[7] = (uint8_t)(rtpTimestamp & 0xFF);
        packetBuffer[8]  = (uint8_t)((rtpSSRC >> 24) & 0xFF);
        packetBuffer[9]  = (uint8_t)((rtpSSRC >> 16) & 0xFF);
        packetBuffer[10] = (uint8_t)((rtpSSRC >> 8) & 0xFF);
        packetBuffer[11] = (uint8_t)(rtpSSRC & 0xFF);

        const int16_t* packetAudio = audioData + offsetSamples;
        // Host->network: 16-bit PCM L16 big-endian payload immediately after the header.
        for (int i = 0; i < packetSamples; ++i) {
            uint16_t s = (uint16_t)packetAudio[i];
            packetBuffer[12 + (i * 2)] = (uint8_t)((s >> 8) & 0xFF);
            packetBuffer[12 + (i * 2) + 1] = (uint8_t)(s & 0xFF);
        }

        bool success = false;
        if (activeRtspTransport == RTSP_TRANSPORT_UDP_UNICAST) {
            success = (rtspUdpClientRtpPort != 0) && rtpUdp.beginPacket(rtspUdpClientIp, rtspUdpClientRtpPort) == 1;
            if (success) {
                success = (rtpUdp.write(packetBuffer, packetSize) == packetSize) &&
                          rtpUdp.endPacket() == 1;
            }
        } else {
            // RTSP interleaved header: '$' 0x24, channel 0, length
            uint8_t inter[4];
            inter[0] = 0x24;
            inter[1] = 0x00;
            inter[2] = (uint8_t)((packetSize >> 8) & 0xFF);
            inter[3] = (uint8_t)(packetSize & 0xFF);
            success = writeAll(client, inter, sizeof(inter), packetWindowMs) &&
                      writeAll(client, packetBuffer, packetSize, packetWindowMs);
        }

        if (success) {
            rtpSequence++;
            rtpTimestamp += (uint32_t)packetSamples;
            audioPacketsSent++;
            consecutiveWriteFailures = 0;  // Reset on success
            offsetSamples += packetSamples;
        } else {
            audioPacketsDropped++;
            consecutiveWriteFailures++;

