matthew73210/birdnetgo-m5stack-atom-echo-rtsp-mic/src/esp32_rtsp_mic_birdnetgo.cpp
            if (consecutiveWriteFailures >= MAX_WRITE_FAILURES) {
                // Sustained failure — Core 1 owns the socket, close it
                Serial.printf("[Core1] %u consecutive write failures, disconnecting\n", consecutiveWriteFailures);
                consecutiveWriteFailures = 0;
                client.stop();
                rtpUdp.stop();
                streamClient = NULL;
                isStreaming = false;
                core1OwnsLED = false;
            }
            return;
        }
    }
}

// ================== CORE 0: NO AUDIO STREAMING ==================
// Audio streaming is now handled entirely on Core 1
// Core 0 only manages client connections and RTSP protocol
// (streamAudio function removed - handled by Core 1 audioCaptureTask)

// RTSP handling
void handleRTSPCommand(WiFiClient &client, String request) {
    String cseq = "1";
    int cseqPos = request.indexOf("CSeq: ");
    if (cseqPos >= 0) {
        cseq = request.substring(cseqPos + 6, request.indexOf("\r", cseqPos));
        cseq.trim();
    }

    lastRTSPActivity = millis();

    if (request.startsWith("OPTIONS")) {
        client.print("RTSP/1.0 200 OK\r\n");
        client.print("CSeq: " + cseq + "\r\n");
        client.print("Public: OPTIONS, DESCRIBE, SETUP, PLAY, TEARDOWN, GET_PARAMETER\r\n\r\n");

    } else if (request.startsWith("DESCRIBE")) {
        String ip = WiFi.localIP().toString();
        String sdp = "v=0\r\n";
        sdp += "o=- 0 0 IN IP4 " + ip + "\r\n";
        sdp += "s=ESP32 RTSP Mic (" + String(currentSampleRate) + "Hz, 16-bit PCM)\r\n";
        // better compatibility: include actual IP
        sdp += "c=IN IP4 " + ip + "\r\n";
        sdp += "t=0 0\r\n";
        sdp += "m=audio 0 RTP/AVP 96\r\n";
        sdp += "a=rtpmap:96 L16/" + String(currentSampleRate) + "/1\r\n";
        sdp += "a=control:track1\r\n";

        client.print("RTSP/1.0 200 OK\r\n");
        client.print("CSeq: " + cseq + "\r\n");
        client.print("Content-Type: application/sdp\r\n");
        client.print("Content-Base: rtsp://" + ip + ":8554/audio/\r\n");
        client.print("Content-Length: " + String(sdp.length()) + "\r\n\r\n");
        client.print(sdp);

    } else if (request.startsWith("SETUP")) {
        if (rtspSessionId.length() == 0) {
            rtspSessionId = String(random(100000000, 999999999));
        }

        String transport = extractRtspHeader(request, "Transport");
        String transportLower = transport;
        transportLower.toLowerCase();
        bool wantsTcp = transportLower.indexOf("rtp/avp/tcp") >= 0 || transportLower.indexOf("interleaved=") >= 0;
        bool wantsUdp = transportLower.indexOf("rtp/avp") >= 0 && transportLower.indexOf("client_port=") >= 0 && transportLower.indexOf("rtp/avp/tcp") < 0;

        activeRtspTransport = RTSP_TRANSPORT_TCP_INTERLEAVED;
        rtspUdpClientIp = client.remoteIP();
        rtspUdpClientRtpPort = 0;
        rtspUdpClientRtcpPort = 0;

        if (wantsUdp) {
            uint16_t clientRtp = 0;
            uint16_t clientRtcp = 0;
            if (!parseRtspClientPorts(transportLower, clientRtp, clientRtcp)) {
                client.print("RTSP/1.0 461 Unsupported Transport\r\n");
                client.print("CSeq: " + cseq + "\r\n\r\n");
                return;
            }
            activeRtspTransport = RTSP_TRANSPORT_UDP_UNICAST;
            rtspUdpClientRtpPort = clientRtp;
            rtspUdpClientRtcpPort = clientRtcp;
            rtpUdp.stop();
            rtpUdp.begin(RTP_UDP_SERVER_PORT);
        } else if (!wantsTcp && transport.length() > 0) {
            client.print("RTSP/1.0 461 Unsupported Transport\r\n");
            client.print("CSeq: " + cseq + "\r\n\r\n");
            return;
        }

        client.print("RTSP/1.0 200 OK\r\n");
        client.print("CSeq: " + cseq + "\r\n");
        // Large timeout reduces ffmpeg keepalive frequency (keepalive sent at timeout/2)
        client.print("Session: " + rtspSessionId + ";timeout=86400\r\n");
        if (activeRtspTransport == RTSP_TRANSPORT_UDP_UNICAST) {
            client.print("Transport: RTP/AVP;unicast;client_port=" + String(rtspUdpClientRtpPort) + "-" +
                         String(rtspUdpClientRtcpPort) + ";server_port=" + String(RTP_UDP_SERVER_PORT) + "-" +
                         String(RTCP_UDP_SERVER_PORT) + ";ssrc=" + String(rtpSSRC, HEX) + ";mode=\"PLAY\"\r\n\r\n");
            simplePrintln("RTSP SETUP using UDP transport to " + rtspUdpClientIp.toString() + ":" + String(rtspUdpClientRtpPort));
        } else {
            client.print("Transport: RTP/AVP/TCP;unicast;interleaved=0-1;mode=\"PLAY\";ssrc=" +
                         String(rtpSSRC, HEX) + "\r\n\r\n");
            simplePrintln("RTSP SETUP using TCP interleaved transport");
        }

    } else if (request.startsWith("PLAY")) {
        // Send PLAY response FIRST (still on Core 0, Core 1 not started yet)
        client.print("RTSP/1.0 200 OK\r\n");
        client.print("CSeq: " + cseq + "\r\n");
        client.print("Session: " + rtspSessionId + "\r\n");
        client.print("Range: npt=0.000-\r\n\r\n");

        rtpSequence = 0;
        rtpTimestamp = 0;
        audioPacketsSent = 0;
        audioPacketsDropped = 0;
        lastStatsReset = millis();
        lastRtspPlayMs = millis();
        rtspPlayCount++;

        // Initialize stream stop flags before handing off
        stopStreamRequested = false;
        streamCleanupDone = false;
        core1OwnsLED = true;
        __asm__ __volatile__("memw" ::: "memory");

        // Hand off client to Core 1 via pointer
        streamClient = &rtspClient;
        isStreaming = true;

        // Start audio capture task
        startAudioCaptureTask();

        // Core 1 now owns LED during streaming
        simplePrintln("STREAMING STARTED via " + String(rtspTransportModeName(activeRtspTransport)));

    } else if (request.startsWith("TEARDOWN")) {
        // Stop streaming FIRST — Core 1 owns the socket during streaming
        if (isStreaming) {
            requestStreamStop("TEARDOWN");
        }

        // Now Core 0 owns the socket again, safe to send response
        client.print("RTSP/1.0 200 OK\r\n");
        client.print("CSeq: " + cseq + "\r\n");
        client.print("Session: " + rtspSessionId + "\r\n\r\n");

        if (!core1OwnsLED) {
            if (ledMode > 0) setStatusLed(CRGB(0, 0, 128));
            else setStatusLed(CRGB(0, 0, 0));
        }
        simplePrintln("STREAMING STOPPED");
    } else if (request.startsWith("GET_PARAMETER")) {
        // Many RTSP clients send GET_PARAMETER as keep-alive.
        client.print("RTSP/1.0 200 OK\r\n");
        client.print("CSeq: " + cseq + "\r\n\r\n");
    }
}

