matthew73210/birdnetgo-m5stack-atom-echo-rtsp-mic/src/esp32_rtsp_mic_birdnetgo.cpp
// RTSP processing (runs on Core 0, only called when !isStreaming)
void processRTSP(WiFiClient &client) {
    if (!client.connected()) return;

    if (client.available()) {
        int available = client.available();
        int spaceLeft = sizeof(rtspParseBuffer) - rtspParseBufferPos - 1;

        if (available > spaceLeft) {
            available = spaceLeft;
        }

        if (available <= 0) {
            static unsigned long lastOverflowWarning = 0;
            if (millis() - lastOverflowWarning > 5000) {
                simplePrintln("RTSP buffer full - resetting");
                lastOverflowWarning = millis();
            }
            rtspParseBufferPos = 0;
            return;
        }

        client.read(rtspParseBuffer + rtspParseBufferPos, available);
        rtspParseBufferPos += available;
        rtspParseBuffer[rtspParseBufferPos] = '\0';

        char* endOfHeader = strstr((char*)rtspParseBuffer, "\r\n\r\n");
        if (endOfHeader != nullptr) {
            *endOfHeader = '\0';
            String request = String((char*)rtspParseBuffer);

            handleRTSPCommand(client, request);

            int headerLen = (endOfHeader - (char*)rtspParseBuffer) + 4;
            int remaining = rtspParseBufferPos - headerLen;
            if (remaining > 0) {
                memmove(rtspParseBuffer, rtspParseBuffer + headerLen, remaining);
            }
            rtspParseBufferPos = remaining;
        }
    }
}


// Web UI is a separate module (WebUI.*)

void setup() {
    FastLED.addLeds<WS2812, WS2812_LED_PIN, GRB>(statusLed, 1);
    FastLED.setBrightness(32);
    setStatusLed(CRGB(0, 0, 0));

    Serial.begin(115200);
    delay(500);
    Serial.println("\n\n=== ESP32 RTSP Mic Starting ===");
    Serial.println("Board: M5Stack AtomS3 Lite");

    // Create task exit semaphore for confirmed Core 1 task shutdown
    taskExitSemaphore = xSemaphoreCreateBinary();

    // Set LED to indicate startup
    setStatusLed(CRGB(128, 128, 0));  // Yellow for startup

    // (4) seed for random(): combination of time and unique MAC
    randomSeed((uint32_t)micros() ^ (uint32_t)(ESP.getEfuseMac() & 0xFFFFFFFF));
    for (uint16_t i = 0; i < TELEMETRY_HISTORY_LEN; ++i) {
        telemetryTempDeciC[i] = INT16_MIN;
    }

    bootTime = millis(); // Store boot time
    rtpSSRC = (uint32_t)random(1, 0x7FFFFFFF);
    Serial.println("Random seed initialized");

    // Enable external antenna (for XIAO ESP32-C6).
    // NOTE: Commented out for M5Stack STAMP S3 - no external antenna control needed
    // pinMode(3, OUTPUT);
    // digitalWrite(3, LOW);
    // Serial.println("RF switch control enabled (GPIO3 LOW)");
    // pinMode(14, OUTPUT);
    // digitalWrite(14, HIGH);
    // Serial.println("External antenna selected (GPIO14 HIGH)");

    // Load settings from flash
    Serial.println("Loading settings...");
    loadAudioSettings();
    Serial.println("Settings loaded");

    // Note: Audio buffers now allocated by Core 1 task (not in main)
    Serial.println("Audio buffers will be allocated by Core 1 pipeline task");

    // WiFi optimization for stable streaming
    Serial.println("Initializing WiFi...");
    WiFi.setSleep(false);

    WiFi.setHostname(DEFAULT_NETWORK_HOSTNAME);

    WiFiManager wm;
    wm.setConnectTimeout(60);
    wm.setConfigPortalTimeout(180);
    if (!wm.autoConnect("ESP32-RTSP-Mic-AP")) {
        simplePrintln("WiFi failed, restarting...");
        ESP.restart();
    }

    simplePrintln("WiFi connected: " + WiFi.localIP().toString());

    // Automatic wall-clock sync via NTP in UTC.
    configTzTime(NTP_TZ, "pool.ntp.org", "time.nist.gov", "time.google.com");
    Serial.print("Waiting for NTP time sync (UTC)...");
    time_t now = 0;
    for (int i = 0; i < 20 && now < 100000; i++) {
        delay(250);
        time(&now);
    }
    if (now > 100000) {
        struct tm ti;
        gmtime_r(&now, &ti);
        char buf[32];
        strftime(buf, sizeof(buf), "%Y-%m-%d %H:%M:%S UTC", &ti);
        Serial.printf(" OK: %s\n", buf);
    } else {
        Serial.println(" failed (will use uptime)");
    }

    // Apply configured WiFi TX power after connect (logs once on change)
    applyWifiTxPower(true);

    const char* wifiHostname = WiFi.getHostname();
    if (wifiHostname && wifiHostname[0] != '\0') {
        networkHostname = String(wifiHostname);
    }

    // mDNS: allows rtsp://<hostname>.local:8554/audio
    if (MDNS.begin(networkHostname.c_str())) {
        MDNS.addService("rtsp", "tcp", 8554);
        MDNS.addService("http", "tcp", 80);
        MDNS.addService("arduino", "tcp", OTA_PORT);
        simplePrintln("mDNS: " + networkHostname + ".local");
    }

    setupArduinoOta();

    Serial.println("Setting up I2S driver...");
    setup_i2s_driver();
    Serial.println("I2S driver ready");

    // Start Core 1 audio pipeline now so raw I2S diagnostics are available even before PLAY.
    startAudioCaptureTask();
    Serial.println("Dual-core audio ready (Core 1 pipeline running for always-on diagnostics)");

    Serial.println("Updating highpass coefficients...");
    updateHighpassCoeffs();
    Serial.println("Highpass coefficients updated");

    if (!overheatLatched) {
        rtspServer.begin();
        rtspServer.setNoDelay(true);
        rtspServerEnabled = true;
    } else {
        rtspServerEnabled = false;
        rtspServer.stop();
    }
    // Web UI
    webui_begin();

    lastStatsReset = millis();
    lastRTSPActivity = millis();
    lastMemoryCheck = millis();
    lastPerformanceCheck = millis();
    lastWiFiCheck = millis();
    minFreeHeap = ESP.getFreeHeap();
    float initialTemp = temperatureRead();
    if (isTemperatureValid(initialTemp)) {
        maxTemperature = initialTemp;
        lastTemperatureC = initialTemp;
        lastTemperatureValid = true;
        overheatSensorFault = false;
    } else {
        maxTemperature = 0.0f;
        lastTemperatureC = 0.0f;
        lastTemperatureValid = false;
        overheatSensorFault = true;
        overheatLastReason = "Thermal protection disabled: temperature sensor unavailable.";
        overheatLastTimestamp = "";
        overheatTripTemp = 0.0f;
        overheatTriggeredAt = 0;
        persistOverheatNote();
        simplePrintln("WARNING: Temperature sensor unavailable at startup. Thermal protection paused.");
    }

