matthew73210/birdnetgo-m5stack-atom-echo-rtsp-mic/src/esp32_rtsp_mic_birdnetgo.cpp
    setCpuFrequencyMhz(cpuFrequencyMhz);
    simplePrintln("CPU frequency set to " + String(cpuFrequencyMhz) + " MHz for optimal thermal/performance balance");

    if (!overheatLatched) {
        simplePrintln("RTSP server ready on port 8554");
        simplePrintln("RTSP URL: rtsp://" + WiFi.localIP().toString() + ":8554/audio");
        simplePrintln("RTSP URL: rtsp://" + networkHostname + ".local:8554/audio");
        // Set LED to blue when ready (green reserved for level indicator)
        if (ledMode > 0) setStatusLed(CRGB(0, 0, 128));
        else setStatusLed(CRGB(0, 0, 0));
    } else {
        simplePrintln("RTSP server paused due to thermal latch. Clear via Web UI before resuming streaming.");
        // Set LED to red when latched
        setStatusLed(CRGB(128, 0, 0));
    }
    simplePrintln("Web UI: http://" + WiFi.localIP().toString() + "/");
}

void loop() {
    webui_handleClient();
    ArduinoOTA.handle();

    if (millis() - lastTempCheck > 5000) { // 5 s
        checkTemperature();
        lastTempCheck = millis();
    }

    if (millis() - lastTelemetrySampleMs > 3000) {
        recordTelemetrySample(audioPipelineLoadPct, lastTemperatureC, lastTemperatureValid);
        lastTelemetrySampleMs = millis();
    }

    // Heap monitoring (every 10 minutes — useful for detecting leaks in long deployments)
    if (millis() - lastMemoryCheck > 600000) { // 10 min
        uint32_t currentHeap = ESP.getFreeHeap();
        if (currentHeap < minFreeHeap) minFreeHeap = currentHeap;
        Serial.printf("[Heap] Current: %u KB, Min: %u KB\n", currentHeap / 1024, minFreeHeap / 1024);
        lastMemoryCheck = millis();
    }

    if (millis() - lastPerformanceCheck > (performanceCheckInterval * 60000UL)) {
        checkPerformance();
        lastPerformanceCheck = millis();
    }

    if (millis() - lastWiFiCheck > 30000) { // 30 s
        checkWiFiHealth(); // without TX power log spam
        lastWiFiCheck = millis();
    }

    checkScheduledReset();

    // RTSP idle timeout — disconnect clients that connect but never stream (60s)
    if (rtspClient && rtspClient.connected() && !isStreaming) {
        if (millis() - lastRTSPActivity > 60000) {
            simplePrintln("RTSP idle timeout — disconnecting");
            rtspClient.stop();
            rtpUdp.stop();
            rtspParseBufferPos = 0;
        }
    }

    // RTSP client management (Core 0) — clear phase separation
    static bool wasStreaming = false;
    if (rtspServerEnabled) {
        // Phase: detect disconnect (Core 1 cleared isStreaming after self-disconnect)
        if (wasStreaming && !isStreaming) {
            // Core 1 already closed the socket — just update LED and log
            if (!core1OwnsLED) {
                if (ledMode > 0) setStatusLed(CRGB(0, 0, 128));
                else setStatusLed(CRGB(0, 0, 0));
            }
            unsigned long sessionSec = (millis() - lastRtspPlayMs) / 1000;
            simplePrintln("RTSP client disconnected (session: " + String(sessionSec) + "s, dropped: " +
                         String(audioPacketsDropped) + ", RSSI: " + String(WiFi.RSSI()) + " dBm)");
        }
        wasStreaming = isStreaming;

        // Phase: accept new client (only when not streaming)
        if (!isStreaming) {
            if (!rtspClient || !rtspClient.connected()) {
                WiFiClient newClient = rtspServer.available();
                if (newClient) {
                    rtspClient = newClient;
                    rtspClient.setNoDelay(true);
                    rtspParseBufferPos = 0;
                    lastRTSPActivity = millis();
                    lastRtspClientConnectMs = millis();
                    rtspConnectCount++;
                    simplePrintln("New RTSP client connected");
                }
            }

            // Phase: RTSP negotiation (only when not streaming)
            if (rtspClient && rtspClient.connected()) {
                processRTSP(rtspClient);
            }
        }
    } else {
        // RTSP server disabled (overheat lockout)
        if (isStreaming) {
            requestStreamStop("server disabled");
            stopAudioCaptureTask();
        }
        if (!core1OwnsLED) {
            if (overheatLatched) {
                setStatusLed(CRGB(128, 0, 0));
            } else {
                if (ledMode > 0) setStatusLed(CRGB(0, 0, 128));
                else setStatusLed(CRGB(0, 0, 0));
            }
        }
    }
    // Handle deferred reboot/reset safely here
    if (scheduledRebootAt != 0 && millis() >= scheduledRebootAt) {
        if (scheduledFactoryReset) {
            resetToDefaultSettings();
        }
        delay(50);
        ESP.restart();
    }
}
